/*
	This file is part the backup utility Mathusalem for Mac OS X.
	Copyright (C) 2008-2009 Pierre-Olivier Latour <info@pol-online.net>
	
	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.
	
	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

"INVALID_TITLE" = "Invalid process arguments!";
"INVALID_MESSAGE" = "When used directly, the Mathusalem application must be launched from the command line with the 'backup' or 'restore' command.";
"INVALID_DEFAULT_BUTTON" = "Quit";

"PROMPT_TITLE" = "A backup is about to start:";
"PROMPT_DEFAULT_BUTTON" = "Run";
"PROMPT_OTHER_BUTTON" = "Cancel";
"PROMPT_MESSAGE" = "If you choose to cancel it, it will run again at the next scheduled time.";

"ABORT_BACKUP_TITLE" = "Are you sure you want to abort the current backup?";
"ABORT_BACKUP_MESSAGE" = "You will need to restart the backup from the beginning.";
"ABORT_RESTORE_TITLE" = "Are you sure you want to abort the current restoration?";
"ABORT_RESTORE_MESSAGE" = "Files restored so far will not be preserved.";
"ABORT_DEFAULT_BUTTON" = "Abort";
"ABORT_OTHER_BUTTON" = "Cancel";

"ERROR_DEFAULT_BUTTON" = "OK";

"STATUS-0" = "Idle";
"STATUS-1" = "Connecting to destination…";
"STATUS-2" = "Checking destination…";
"STATUS-3" = "Scanning source…";
"STATUS-4" = "Copying %@ items…";
"STATUS-5" = "Creating archive…";
"STATUS-6" = "Extracting archive…";
"STATUS-7" = "Creating disk image…";
"STATUS-8" = "Mounting disk image…";
"STATUS-9" = "Downloading %@file from destination…";
"STATUS-10" = "Uploading %@file to destination…";
"STATUS-11" = "Deleting file at destination…";
"STATUS-12" = "Running executable…";

"STATUS-TRANSFER-PAUSED" = "(File transfer failed, click the restart button to try again)";

"SEGMENT-FORMAT" = "Processing segment %i of %i: ";

"STATUS-MB-FORMAT" = "%.1f Mb ";
"STATUS-KB-FORMAT" = "%i Kb ";

"ERROR-1" = "Unable to access:";
"ERROR-2" = "Unable to retrieve item info:";
"ERROR-3" = "Unable to set item permissions:";
"ERROR-4" = "Unable to move item:";
"ERROR-5" = "Unable to delete item:";
"ERROR-6" = "Unable to copy item:";
"ERROR-7" = "Unable to create directory:";
"ERROR-8" = "Unable to write file:";
"ERROR-9" = "Unable to create archive:";
"ERROR-10" = "Unable to extract archive:";
"ERROR-11" = "Unable to create disk image:";
"ERROR-12" = "Unable to mount disk image:";
"ERROR-13" = "Unable to unmount disk image:";
"ERROR-14" = "Unable to read BOM file:";
"ERROR-15" = "Unable to retrieve BOM entry:";
"ERROR-16" = "Unable to check destination:";
"ERROR-17" = "Unable to download file from destination:";
"ERROR-18" = "Unable to upload file to destination:";
"ERROR-19" = "Unable to delete file at destination:";
"ERROR-20" = "Unable to run executable:";
"ERROR-21" = "Not enough free space on local disk:";
